#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");

	//-------------------------------САМА ПРОГА-------------------------------------

	int n, k, x = 0;

	cout << "Введите N: ";
	cin >> n;

	cout << endl << "Введите степень k: ";
	cin >> k;

	for (int i = 0; i < n; i++)
	{
		x = x + pow((i + 1), k);
	}

	cout << endl << "Сумма: " << x;

	cout << endl;

	system("pause");


	return 0;
}
